[
{"reviewer": ["BooBoo", "danish", "Prachita Garodia", "VikSpark", "BunT", "Gautam", "Amazon Customer", "Amazon Customer", "Adrian", "Dan Kazymerchyk", "Steve", "Mr S F Taylor", "Peapod"], "title": ["Don’t waste your time and money", "Robust", "Awesome", "Solid", "Just wat I needed!!", "OTTERBOX is great...👌🏼", "Nice product", "Sturdy cover", "Worst iPhone Case I have ever owned...", "Bulky case with no protection", "The best tough quality case", "BRICK", "Does its job very well..."], "rating": [], "date_of_review": ["Reviewed in India on 20 March 2020", "Reviewed in India on 27 December 2019", "Reviewed in India on 29 February 2020", "Reviewed in India on 26 January 2020", "Reviewed in India on 15 April 2020", "Reviewed in India on 25 December 2019", "Reviewed in India on 4 March 2020", "Reviewed in India on 4 March 2020", "Reviewed in the United Kingdom on 20 May 2020", "Reviewed in Canada on 15 August 2020", "Reviewed in the United Kingdom on 1 November 2019", "Reviewed in the United Kingdom on 27 May 2020", "Reviewed in the United Kingdom on 31 December 2019"], "verified_review": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "review": ["\n\n\n\n\n\n\n\n\n\n  \n  \n    ", "\n  Don’t think its a genuine Otter box product because the case is falling apart just 15 days after I’ve received it.", "Wouldn’t recommend at all.\n", "\n  \n", "\n\n\n\n\n\n\n\n\n\n  \n  \n    ", "\n  Robust double protection with very high quality standards. Not funky in any way.\n", "\n  \n", "\n\n\n\n\n\n\n\n\n\n  \n  \n    ", "\n  Otterbox is the goto for protection of mobiles.", "Very sturdy construction with a good dual layered protection\n", "\n  \n", "\n\n\n\n\n\n\n\n\n\n  \n  \n    ", "\n  Bulky yes, yet light and seems like built to protect!\n", "\n  \n", "\n\n\n\n\n\n\n\n\n\n  \n  \n    ", "\n  Very nice and robust!!", "Otter box is the best in the world and it lives with its quality and standards!!", "Provides a very good protection.\n", "\n  \n", "\n\n\n\n\n\n\n\n\n\n  \n  \n    ", "\n  No quality matches or comes even near OTTERBOX... amazing & true protection...👍🏼\n", "\n  \n", "\n\n\n\n\n\n\n\n\n\n  \n  \n    ", "\n  Makes iPhone heavy..but is a very good product\n", "\n  \n", "\n\n\n\n\n\n\n\n\n\n  \n  \n    ", "\n  Nice product\n", "\n  \n", "\n\n\n\n\n\n\n\n\n\n  \n  \n    ", "\n  I have to start by saying... I am a LONG TIME Otterbox fan...", "My last 4 phones have had Otterbox cases, and I have had no problems with them... in fact... I was a bit of an Otterbox evangelist...", "When I got my upgrade to a New iPhone 11, I knew what company I was going to go for...", "HOWEVER... I was sorely disappointed...", "My cases in past have been the Symmetry, sleek case, which maintaining the beauty of the phone while keeping it safe from accidental drops (I have three kids, it happened more than I EVER cared to admit).", "However, they did not have the Symmetry available for my phone (well, not technically true, they only had it in the BRIGHT YELLOW, not quite my style).", "BUT, they had other Otterbox cases, so I thought... MUST be one I can find... and it's a brand I trust...", "So I found this one....", "When I received it I was slightly underwhelmed by the two different parts. Not entirely sure what the purpose of the softer rubber one was, not really knowing why it was in two parts, but, it fit on my phone, was a bit bulkier than what I was used to, but it appeared to do the job... UNTIL I did ANYTHING other than holding it like a glass egg with mittens.", "The phone dropped (again, it happens a lot with children, unfortunately), and landed flat on the front screen.", "When I saw it from afar, I was like, that sucks, but I have an AWESOME case on it, so it will be fine, right?", "WRONG!!!", "Upon picking the phone up, I notice that the ENTIRE front screen is SMASHED... I'm talking TOTAL Annihilation, not just a little sliver...", "I was confused as to how this could happen, as SURELY, the case is tested (I refer to the description of the case, found below again for ease).", "I was no longer enjoying 'non-stop texting even when my device took a tumble.' And it was CLEAR from the point of impact (the part that actually hit the ground and caused the smash)...", "You see, the soft inner layer, which is advertised as an impact absorber, is in fact the opposite. The phone fell flat on the screen, and it was the soft rubber (where the volume control is) that bent in on the impact (unlike the hard material that ACTUALLY did the job it was meant to do). As the soft inner layer crumbled on the impact, the front glass hit the ground RIGHT at that point, sending shockwaves through the phone, to the tune of £200 for my repair.", "£200 it's costing me to fix the glass of my phone which was supposed to be protected byt this (not OVERLY cheap case) from a company that built a case 'DESIGNED TO PROTECT, that will perform when you need it most.'", "NEEDLESS to say, I am VERY disappointed... and will NOT be buying an Otterbox case, upon the arrival of my fixed phone from Apple (It was 2 weeks old for crying out loud!!!)", "2-Layer protection: Soft inner and hard outer layers absorb and deflect impacts while protecting from scratches and dings. You enjoy non-stop texting even when your device takes a tumble. (NOT AT ALL... Soft inner layer CAUSED the issue, in my humble opinion, and I def was not enjoying my texting... couldn't flipping read the screen!", "Slim design: this sleek case profile featuring a polycarbonate outer shell makes commuter Series seriously pocket-friendly. (I'll give them that, it fit in my pocket just fine... BUT I am a BIG guy, so that was never going to be an issue, I got big pockets!!!!)", "Dust protection: block out dust, dirt and pocket lint (I mean.. sure... it did that... but what case wouldn't?)", "Designed to protect: tested by US. Built for you. Otter box Certified Drop+ protection means 24+ tests over 238+ hours, which certify that this slim, low-profile case performs when it matters most (DESIGNED TO PROTECT WHAT?????? What tests didnt include a drop onto the glass, or am I just that unlucky? Perhaps)...", "Overall, sad times... I've loved boasting about my OtterBox in past... but long gone are those days.\n", "\n  \n", "\n\n\n\n\n\n\n\n\n\n  \n  \n    ", "\n  If you want a really bulky case that doesn’t stay on your phone well and offers no protection, this is the case for you! Dropped my phone 2 times, first one on gravel, you can see the point of impact I drew the arrow pointing to, where the case should have been protecting, the second time I dropped it on a flat floor and it smashed a camera out. Otter box has turned to garbage and had cost me hundreds. There are better options out there I’m sure.", "The way I see it otter box owes me an iPhone 11\n", "\n  \n", "\n\n\n\n\n\n\n\n\n\n  \n  \n    ", "\n  I bought 3 cases for my iPhone 11, all of them fell short of protecting my phone if dropped.", "This otter box cover is the best with its inner cover and outer cover I thought it would be to big but no, it’s just right and it feels quality , good grip and yes it’s more expensive than the cheap rubbish out there but believe me this is a great case that will protect your expensive phone if dropped .\n", "\n  \n", "\n\n\n\n\n\n\n\n\n\n  \n  \n    ", "\n  Another disappointment from Otter. Tried this and there tough box. Turns the large iPhone 11 into a brick. Case comes in two pieces and the rubber shock proof part seems like it would pick up every bit of dirt going. Going to stick with Griffin surviver series that I’ve had on all my old iPhone as there slimmer and stiffer and sits nicer in the hand.\n", "\n  \n", "\n\n\n\n\n\n\n\n\n\n  \n  \n    ", "\n  This is an absolute tank of a case, and provides probably the most protection possible. I had similar for my old iPhone SE, and it was perfect, but the 11 is so much bigger that the case turns an already large phone into a brick. Buy if you want ultimate protection but look elsewhere if you intend on even attempting single handed usage.\n", "\n  \n"], "votes": ["7 people found this helpful", "16 people found this helpful", "2 people found this helpful", "2 people found this helpful", "One person found this helpful"]}
]